In [2]:
import pandas as pd
import os

In [8]:
df_plates = pd.read_csv(os.path.join("license_plates", "license_plates.csv"), index_col = 0)
df_crimes = pd.read_csv(os.path.join("crime", "crimes.csv"), index_col = 0)
df_income = pd.read_csv(os.path.join("income", "income.csv"), index_col = 0)

In [9]:
df_plates.head()

  license_plate  kreis_key     kreis_name    einw
0            AM       9361         Amberg   42052
1            AN       9561        Ansbach   41681
2            AB       9661  Aschaffenburg   70858
3             A       9761       Augsburg  295830
4           BAD       8211    Baden-Baden   55449

In [10]:
df_crimes.head()

,kreis_key,crimes_2013,crimes_2014,crimes_2015,crimes_2016,crimes_2017,crimes_2018,crimes_2019,crimes_2020
0,1001,8876.0,9754.0,10828.0,9993.0,8907.0,8156.0,8617.0,8380.0
1,1002,24043.0,24380.0,26078.0,25908.0,23934.0,24621.0,22452.0,21384.0
2,1003,24526.0,24907.0,22881.0,25647.0,23614.0,22685.0,21768.0,20942.0
3,1004,11737.0,13078.0,17418.0,14524.0,9751.0,10688.0,11397.0,9453.0
4,1051,7248.0,7189.0,7345.0,7661.0,7262.0,7224.0,6786.0,6597.0

In [11]:
df_income.head()

,kreis_key,income_pp_2000,income_pp_2001,income_pp_2002,income_pp_2003,income_pp_2004,income_pp_2005,income_pp_2006,income_pp_2007,income_pp_2008,income_pp_2009,income_pp_2010,income_pp_2011,income_pp_2012,income_pp_2013,income_pp_2014,income_pp_2015,income_pp_2016,income_pp_2017,income_pp_2018
1,1001,14763,15144,15177,15499,15453,16215,16827,17521,17409,17344,17256,17551,17964,17987,18007,18255,18128,18498,18773
2,1002,14348,14833,14909,15295,15354,15770,15940,16322,16563,16675,16771,17055,17416,17906,17677,18119,18469,18943,19392
3,1003,14467,14977,15191,15890,16157,16538,16697,16921,17042,17047,17024,17351,17823,17936,18182,19008,19122,19658,20120
4,1004,14766,15487,15216,15324,15032,15438,15697,16022,16142,16198,16146,16495,17037,17403,17956,18121,18795,19275,19775
5,1051,14038,14651,14687,15283,15777,16071,16290,16738,17251,17282,17617,18353,18944,19475,20090,20900,21401,22055,22498

In [13]:
df = df_plates.merge(df_income, on = "kreis_key", how = "outer")
df = df.merge(df_crimes, on = "kreis_key", how = "outer")

In [14]:
df.head()

,license_plate,kreis_key,kreis_name,einw,income_pp_2000,income_pp_2001,income_pp_2002,income_pp_2003,income_pp_2004,income_pp_2005,...,income_pp_2017,income_pp_2018,crimes_2013,crimes_2014,crimes_2015,crimes_2016,crimes_2017,crimes_2018,crimes_2019,crimes_2020
0,AM,9361,Amberg,42052.0,16120,16451,16433,16878,17318,17724,...,21008,21981,3009.0,3073.0,2961.0,2899.0,2867.0,2878.0,2564.0,2337.0
1,AN,9561,Ansbach,41681.0,17507,18162,17736,17849,18038,18022,...,21853,22559,2772.0,2993.0,3130.0,3294.0,3229.0,3116.0,3191.0,3078.0
2,AB,9661,Aschaffenburg,70858.0,17228,17972,17975,18703,19305,19802,...,23377,24114,6053.0,5699.0,5972.0,5524.0,5248.0,5127.0,5359.0,5182.0
3,A,9761,Augsburg,295830.0,15590,16010,15969,16279,16471,16432,...,19415,20053,22297.0,23188.0,25659.0,22876.0,20899.0,21206.0,21404.0,20397.0
4,BAD,8211,Baden-Baden,55449.0,25133,25229,23987,23945,23923,25003,...,31944,32416,3972.0,4243.0,4630.0,4315.0,4270.0,4170.0,5813.0,5553.0

In [15]:
df.to_csv("data.csv")